'''1. В диапазоне натуральных чисел от 2 до 99 определить,
сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
Примечание: 8 разных ответов.
'''


print('Кратность чисел от 2 до 99 числам от 2 до 9 и их \
количество:\n')

print('{0:^7}| {1:^5} {2:^5} {3:^5} {4:^5} {5:^5} {6:^5} {7:^5} {8:^5}| {9:^7}'
      .format('a/b', *(digits:=range(2, 10)), 'Кол-во'))

print('-' * 64)

ans = dict.fromkeys(digits, 0)
for num in range(2, 100):
    count = 0
    row = []
    for dig in digits:
        if not num % dig:
            row.append('True')
            count += 1
            ans[dig] += 1
        else:
            row.append('False')

    print('{0:^7}| {1:<5} {2:<5} {3:<5} {4:<5} {5:<5} {6:<5} {7:<5} {8:<5}| \
{9:^7}'.format(num, *row, count))
print('-' * 64)
print('{0}| {1:<4} {2:<4} {3:<4} {4:<4} {5:<4} {6:<4} {7:<4} {8:<3}|'
      .format('Кол-во', *ans.values()))
